tap "anomalyco/tap"
tap "oven-sh/bun"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Cross-shell prompt for astronauts
brew "starship"
# Command-line interface for Vercel
brew "vercel-cli"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode", trusted: true
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun", trusted: true
# Enable Windows-like alt-tab
cask "alt-tab"
# Terminal interface for Antigravity agents
cask "antigravity-cli"
# AI Coding Agent IDE
cask "antigravity-ide"
# Allows connection to a computer remotely
cask "anydesk"
# Desktop password and login vault
cask "bitwarden"
# Terminal-based AI coding assistant
cask "claude-code"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Customise mouse behavior
cask "linearmouse"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Open-source code editor
cask "visual-studio-code"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "usernamehw.errorlens"
vscode "yoavbls.pretty-ts-errors"
uv "db-version-cli"
npm "corepack"
