# ===========================================
# Brewfile - Backup de configuración Homebrew
# Restaurar con: brew bundle --file=~/.Brewfile
# ===========================================

# --- TAPS ---
tap "homebrew/bundle"

# --- CLI TOOLS ---
# Shell & Terminal
brew "bat"                      # cat con syntax highlighting
brew "eza"                      # ls moderno con iconos
brew "fzf"                      # Fuzzy finder (Ctrl+R)
brew "zoxide"                   # Navegación inteligente (z)
brew "zsh-syntax-highlighting"  # Colores en comandos

# Development
brew "gh"                       # GitHub CLI
brew "mprocs"                   # Ejecutar múltiples procesos

# Security
brew "gnupg"                    # GPG para firmar commits
brew "pinentry-mac"             # Diálogo de contraseña GPG

# AI
brew "gemini-cli"               # CLI de Gemini AI

# --- APLICACIONES ---
# Terminal
cask "iterm2"                   # Terminal avanzada

# Editores & IDEs
cask "visual-studio-code"       # Editor principal
cask "cursor"                   # Editor con AI
cask "jetbrains-toolbox"        # IDEs JetBrains

# DevOps
cask "orbstack"                 # Docker & Linux VMs
cask "postman"                  # API testing

# Browser
cask "google-chrome"            # Navegador principal

# macOS Utilities
cask "alt-tab"                  # Alt-tab estilo Windows
cask "linearmouse"              # Configuración de mouse
cask "keyclu"                   # Mostrar atajos de teclado
cask "stats"                    # Monitor de sistema

# AI
cask "claude-code"              # CLI de Claude

# Entertainment
cask "spotify"                  # Música
cask "steam"                    # Gaming
cask "epic-games"               # Gaming

# --- VS CODE EXTENSIONS ---
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "eamodio.gitlens"
vscode "usernamehw.errorlens"
vscode "yoavbls.pretty-ts-errors"
vscode "dsznajder.es7-react-js-snippets"
vscode "formulahendry.auto-rename-tag"
vscode "christian-kohler.path-intellisense"
vscode "bradlc.vscode-tailwindcss"
vscode "ms-azuretools.vscode-docker"
vscode "prisma.prisma"
vscode "mikestead.dotenv"
vscode "pkief.material-icon-theme"
vscode "github.copilot"
vscode "github.copilot-chat"
